---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalMass
source: html/451f0253-7cd7-c6ac-897c-63cc7a3b5156.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalMass Property

The thermal mass value (Cth-value) of the construction.

## Syntax (C#)
```csharp
public double ThermalMass { get; }
```